{
  "common": {
    "loading": "Chargement...",
    "error": "Erreur",
    "success": "Succès",
    "search": "Rechercher",
    "clear": "Effacer",
    "save": "Enregistrer",
    "cancel": "Annuler"
  },
  "nav": {
    "problems": "Problèmes",
    "submissions": "Soumissions",
    "admin": "Panneau d'administration",
    "teacher": "Panneau Enseignant",
    "judge": "Juge",
    "login": "Se connecter",
    "register": "Registre",
    "profile": "Profil",
    "logout": "Déconnexion",
    "statistics": "Statistiques",
    "users": "Utilisateurs",
    "about": "À propos"
  },
  "problems": {
    "title": "Problèmes",
    "search_placeholder": "Problèmes de recherche…",
    "tags_placeholder": "Recherche par balises...",
    "category_placeholder": "Recherche par catégorie...",
    "all_difficulties": "Toutes les difficultés",
    "easy": "Facile",
    "medium": "Moyen",
    "hard": "Dur",
    "apply": "Appliquer",
    "difficulty": "Difficulté"
  },
  "submissions": {
    "title": "Soumissions",
    "status": "Statut",
    "language": "Langue",
    "time": "Temps",
    "verdict": "Verdict",
    "all_languages": "Toutes les langues",
    "all_verdicts": "Tous les verdicts"
  },
  "submission_form": {
    "submit_solution": "Soumettre la solution",
    "language": "Langue",
    "load_file": "Charger le fichier",
    "submit": "Soumettre",
    "submitting": "Soumission...",
    "please_wait": "Veuillez patienter avant de soumettre à nouveau",
    "file_too_large": "Le fichier est trop volumineux. La taille maximale est de {{size}} Ko.",
    "failed_to_read": "Échec de la lecture du fichier.",
    "cpp": "C++",
    "python": "Python",
    "javascript": "Javascript"
  },
  "results": {
    "result": "Résultat",
    "cases": "cas",
    "ms": "MS",
    "kb": "Ko",
    "test_cases": "Cas de tests"
  },
  "submission_detail": {
    "title": "Soumission",
    "problem": "Problème",
    "language": "Langue",
    "id": "IDENTIFIANT",
    "source_code": "Code source (cliquez pour voir)",
    "loading": "Chargement de la soumission…"
  },
  "feedback": {
    "compilation_error": "Votre code comporte une erreur de compilation. Consultez la liste de contrôle pour plus de détails.",
    "all_passed": "Super! Tous les cas de test ont réussi !",
    "almost_there": "J'y suis presque ! Un cas de test a échoué.",
    "some_failed": "{{failed}} cas de test ont échoué. Continuez à essayer !",
    "none_passed": "Aucun cas de test n'a encore été réussi. Examinez attentivement votre logique.",
    "runtime_error": "Votre programme s'est écrasé lors de l'exécution. Vérifiez les limites du tableau et les références nulles.",
    "slow_solution": "Votre solution est lente. Pensez à optimiser votre algorithme."
  },
  "problem_detail": {
    "title": "Problème",
    "statement": "Énoncé du problème",
    "time_limit": "Temps",
    "memory_limit": "Mémoire",
    "placeholder": "Espace réservé"
  },
  "table": {
    "id": "IDENTIFIANT",
    "user": "Utilisateur",
    "problem": "Problème",
    "verdict": "Verdict",
    "language": "Langue",
    "when": "Quand",
    "status": "Statut",
    "time": "Temps"
  },
  "submission": {
    "title": "Soumission",
    "beginner_tips": "💡 Conseils pour débutants",
    "analyzing": "Analyse de votre code...",
    "common_mistakes": "Erreurs courantes à vérifier :",
    "no_issues": "Aucun problème détecté"
  },
  "checklist": {
    "syntax": "Syntaxe",
    "variables": "Variables",
    "logic": "Logique",
    "types": "Espèces",
    "type_conversion": "Conversion de types",
    "type_hints": "Conseils de saisie",
    "type_coercion": "Tapez la coercition",
    "data_types": "Types de données",
    "large_numbers": "Grands nombres",
    "integer_overflow": "Débordement d'entier",
    "indentation": "Échancrure",
    "structure": "Structure",
    "input_output": "Entrée/Sortie",
    "linking": "Enchaînement",
    "methods": "Méthodes",
    "arrays": "Tableaux",
    "null_undefined": "Null/Indéfini",
    "code_quality": "Qualité du code"
  },
  "hints": {
    "cpp": {
      "syntax": "Point-virgule ou crochet manquant : vérifiez la ligne d'erreur de compilation",
      "variables": "Variable non déclarée - vérifiez l'orthographe et déclarez avant utilisation",
      "linking": "Fonction/variable non liée - vérifiez si tous les fichiers sources sont compilés",
      "type_mismatch": "Incompatibilité de type : vérifiez que les types de données correspondent aux paramètres de la fonction",
      "type_conversion": "Impossible de convertir le type - utilisez une conversion explicite : (int)value, (double)value",
      "logic": "Échec du scénario de test : vérifiez l'algorithme et les conditions aux limites",
      "input_output": "Vérifier l'analyse du format d'entrée et le formatage de sortie",
      "data_types": "Vérifiez que les types de données correspondent à l'entrée (int vs long long pour les grands nombres)",
      "integer_overflow": "Vérifiez le débordement : la plage int est de ~-2B à +2B. Utilisez long long pour des valeurs plus grandes",
      "code_quality": "Envisagez d'optimiser les entrées volumineuses si nécessaire"
    },
    "python": {
      "indentation": "Corriger l'indentation - assurer un espacement cohérent (généralement 4 espaces)",
      "syntax": "Erreur de syntaxe - vérifiez les deux-points après if/for/while/def/class",
      "variables": "Variable non définie - vérifiez l'orthographe et la portée",
      "types": "Erreur de type - vérifiez les conversions de type (int(), str(), etc.)",
      "type_hints": "Astuce : utilisez int(input()) pour les nombres, input() renvoie str par défaut",
      "index_error": "Index hors plage - vérifiez les limites du tableau",
      "methods": "La méthode n'existe pas - vérifiez le type d'objet et les méthodes disponibles",
      "type_conversion": "Impossible de convertir la valeur - par exemple, int('abc') échoue. Vérifier que l'entrée est valide",
      "logic": "Échec du scénario de test : vérifiez la logique de l'algorithme",
      "data_types": "Astuce : rappelez-vous que int/float/str sont différents. int('123') != '123'",
      "large_numbers": "Python gère automatiquement les gros entiers, mais vérifie les boucles infinies ou la récursivité",
      "code_quality": "Super! Tous les tests réussissent"
    },
    "javascript": {
      "syntax": "Erreur de syntaxe : vérifiez les crochets, les accolades et les parenthèses",
      "variables": "Variable non définie - déclarer avec const/let/var",
      "types": "Erreur de type - vérifiez les types de variables et les appels de fonction",
      "type_coercion": "Astuce : utilisez === et non ==. '5' == 5 est vrai, mais '5' === 5 est faux",
      "null_undefined": "Erreur nulle ou non définie - vérifiez si la valeur existe avant de l'utiliser",
      "nan": "Got NaN (Not a Number) - assurez-vous de convertir correctement les chaînes en nombres : Number(x) ou parseInt(x)",
      "logic": "Le test a échoué - vérifiez la logique de l'algorithme",
      "data_types": "Astuce : rappelez-vous « 123 » (chaîne) != 123 (nombre). Utilisez Number() pour convertir",
      "large_numbers": "Pour les nombres > 2^53, utilisez BigInt : BigInt(9007199254740991) ou 123n",
      "code_quality": "Excellent! Tous les tests réussissent"
    }
  },
  "sample_cases": {
    "title": "Exemple d'entrée/sortie",
    "sample": "Échantillon",
    "input": "Saisir",
    "output": "Sortir",
    "copy": "Copie",
    "copied": "Copié!"
  },
  "load_more": "Charger plus",
  "pagination": {
    "previous": "Précédent",
    "next": "Suivant",
    "page": "Page"
  },
  "guide": {
    "adminTeacherGuide": "Guide de l'administrateur et de l'enseignant",
    "adminGuide": {
      "section_1_title": "1. Présentation du panneau d'administration",
      "section_1_desc": "Comprendre vos responsabilités et capacités administratives",
      "section_1_p1": "Le panneau d'administration est une interface de gestion puissante pour superviser l'ensemble de la plateforme CodeFix AI.",
      "section_1_p2": "En tant qu'administrateur, vous avez un contrôle total sur les utilisateurs, les problèmes et les soumissions.",
      "section_1_p3": "Vous pouvez gérer les rôles des utilisateurs, créer et modifier des problèmes, supprimer des soumissions et afficher des statistiques complètes.",
      "section_1_p4": "Toutes les actions administratives sont enregistrées à des fins de sécurité et d'audit.",
      "section_1_p5": "Le tableau de bord d'administration fournit des informations en temps réel sur l'utilisation et les performances de la plateforme.",
      "section_1_p6": "Accédez au panneau d'administration à partir du menu de navigation principal - seuls les administrateurs peuvent voir cette option.",
      "section_2_title": "2. Gestion des utilisateurs",
      "section_2_desc": "Comment gérer les comptes d'utilisateurs, les rôles et les autorisations",
      "section_2_p1": "La section Utilisateurs affiche tous les utilisateurs enregistrés sur la plateforme avec leurs coordonnées.",
      "section_2_p2": "Vous pouvez rechercher des utilisateurs par nom d'utilisateur, identifiant ou d'autres critères pour trouver rapidement des comptes spécifiques.",
      "section_2_p3": "Gestion des rôles : modifiez le rôle de n'importe quel utilisateur entre UTILISATEUR, ÉTUDIANT, ENSEIGNANT ou ADMIN.",
      "section_2_p4": "UTILISATEUR : les utilisateurs réguliers peuvent uniquement résoudre les problèmes et consulter leurs propres soumissions.",
      "section_2_p5": "ÉTUDIANT : les étudiants ont les mêmes privilèges que les utilisateurs mais sont marqués pour le suivi des cours.",
      "section_2_p6": "ENSEIGNANT : les enseignants peuvent créer et gérer des problèmes, consulter les soumissions des élèves concernant leurs problèmes et accéder aux analyses.",
      "section_2_p7": "ADMIN : accès complet au système. Seuls les administrateurs existants peuvent promouvoir les utilisateurs au statut d'administrateur pour des raisons de sécurité.",
      "section_2_p8": "La pagination vous aide à naviguer efficacement dans de grandes listes d'utilisateurs.",
      "section_2_p9": "Chaque enregistrement d'utilisateur indique la date d'adhésion et le rôle actuel pour une référence rapide.",
      "section_3_title": "3. Gérer les problèmes",
      "section_3_desc": "Création, modification et suppression de problèmes de codage",
      "section_3_p1": "La section Problèmes vous permet de gérer l'intégralité de la bibliothèque de problèmes.",
      "section_3_p2": "Créer de nouveaux problèmes : cliquez sur \"Créer un problème\" pour ajouter de nouveaux défis de codage à la plateforme.",
      "section_3_p3": "Modifier les données du problème : modifiez les titres des problèmes, les descriptions, les déclarations, les niveaux de difficulté et les limites des ressources.",
      "section_3_p4": "Modifier les cas de test : ajoutez, mettez à jour ou supprimez des cas de test qui valident les soumissions des utilisateurs.",
      "section_3_p5": "Niveaux de difficulté : définissez les problèmes comme FACILE, MOYEN ou DIFFICILE pour aider les utilisateurs à trouver les défis appropriés.",
      "section_3_p6": "Limites de ressources : configurez les limites de temps (millisecondes) et les limites de mémoire (mégaoctets) pour chaque problème.",
      "section_3_p7": "Visibilité : contrôlez quels utilisateurs peuvent voir chaque problème (publié ou brouillon).",
      "section_3_p8": "Statistiques des problèmes : affichez le nombre d'utilisateurs qui ont résolu chaque problème et le taux d'acceptation de la solution.",
      "section_3_p9": "Supprimer les problèmes : supprimez les problèmes qui ne sont plus pertinents (cela supprimera également les soumissions associées).",
      "section_3_p10": "Recherche et filtre : trouvez rapidement des problèmes par titre, difficulté ou catégorie.",
      "section_4_title": "4. Examen des soumissions",
      "section_4_desc": "Surveiller et gérer les soumissions des utilisateurs",
      "section_4_p1": "La section Soumissions affiche toutes les soumissions de code des utilisateurs pour tous les problèmes.",
      "section_4_p2": "Filtrez les soumissions par statut de verdict : ACCEPTED, WRONG_ANSWER, TIME_LIMIT_EXCEEDED, COMPILATION_ERROR, etc.",
      "section_4_p3": "Affichez des informations détaillées sur chaque soumission, notamment l'utilisateur, le problème, la langue et l'horodatage.",
      "section_4_p4": "Mesures de performances : consultez le temps d'exécution et l'utilisation de la mémoire pour chaque soumission.",
      "section_4_p5": "Afficher le code source : cliquez sur n'importe quelle soumission pour consulter le code de l'utilisateur.",
      "section_4_p6": "Supprimer les soumissions : supprimez les soumissions (utile pour maintenir la propreté de la base de données ou gérer le contenu inapproprié).",
      "section_4_p7": "Répartition des verdicts : comprenez pourquoi les soumissions ont échoué avec des indicateurs d'état colorés.",
      "section_4_p8": "La pagination permet de gérer efficacement les grandes listes de soumission.",
      "section_4_p9": "Exporter des données : utilisez les données pour générer des rapports sur les performances des utilisateurs et la difficulté des problèmes.",
      "section_5_title": "5. Analyses et statistiques",
      "section_5_desc": "Comprendre les métriques et les performances de la plateforme",
      "section_5_p1": "La page Statistiques fournit des informations complètes sur l'utilisation de la plateforme.",
      "section_5_p2": "Statistiques des utilisateurs : suivez le nombre total d'utilisateurs, la répartition des rôles et les tendances de croissance.",
      "section_5_p3": "Statistiques des problèmes : consultez le nombre total de problèmes, la répartition des difficultés et les taux de résolution.",
      "section_5_p4": "Statistiques de soumission : surveillez les soumissions par verdict, langue et périodes.",
      "section_5_p5": "Mesures de performances : suivez les performances du système, l’utilisation des ressources et les temps de réponse.",
      "section_5_p6": "Engagement des utilisateurs : identifiez les utilisateurs actifs, les problèmes les plus courants et les défis tendances.",
      "section_5_p7": "Utilisez ces données pour prendre des décisions éclairées concernant la création de contenu et les améliorations de la plateforme.",
      "section_5_p8": "Exportez des rapports pour des présentations, des réunions ou de la documentation officielle.",
      "section_5_p9": "Identifiez les goulots d'étranglement : les problèmes liés à des taux d'acceptation très faibles peuvent nécessiter des éclaircissements."
    },
    "teacherGuide": {
      "section_1_title": "1. Débuter en tant qu'enseignant",
      "section_1_desc": "Créer votre compte enseignant et comprendre votre rôle",
      "section_1_p1": "Votre rôle ENSEIGNANT vous donne des privilèges spéciaux pour créer et gérer des problèmes de codage.",
      "section_1_p2": "Contrairement aux utilisateurs réguliers, vous pouvez concevoir des problèmes personnalisés pour vos étudiants ou la communauté.",
      "section_1_p3": "Accédez au tableau de bord de l'enseignant à partir du menu de navigation principal.",
      "section_1_p4": "Votre tableau de bord affiche tous les problèmes que vous avez créés et leurs mesures de performances.",
      "section_1_p5": "Vous pouvez voir quels étudiants ont tenté vos problèmes et leurs taux de réussite.",
      "section_1_p6": "Utilisez ces informations pour affiner les énoncés des problèmes et ajuster les niveaux de difficulté.",
      "section_2_title": "2. Créer et gérer des problèmes",
      "section_2_desc": "Comment concevoir des problèmes de codage efficaces",
      "section_2_p1": "Commencez par un énoncé clair du problème : rédigez une description claire et concise de ce que les élèves doivent résoudre.",
      "section_2_p2": "Spécifier le format d'entrée/sortie : soyez très explicite sur le format d'entrée, le format de sortie et les contraintes.",
      "section_2_p3": "Définissez des limites appropriées : choisissez des limites de temps et de mémoire réalistes en fonction de la complexité attendue de la solution.",
      "section_2_p4": "Créez des cas de test représentatifs : incluez des cas de test simples et complexes pour valider minutieusement les solutions.",
      "section_2_p5": "Exemples de cas de test : fournissez 1 à 2 exemples de cas de test visibles pour aider les étudiants à comprendre le problème.",
      "section_2_p6": "Cas de test cachés : créez des cas de test cachés supplémentaires pour empêcher les solutions codées en dur.",
      "section_2_p7": "Niveau de difficulté : évaluez honnêtement la difficulté du problème (FACILE, MOYEN, DIFFICILE).",
      "section_2_p8": "Balises de problèmes : ajoutez des balises pour aider les élèves à trouver des problèmes connexes et à développer progressivement leurs compétences.",
      "section_2_p9": "Révision et test : avant de publier, résolvez le problème vous-même pour vous assurer que la solution est correcte.",
      "section_3_title": "3. Analyser les soumissions des étudiants",
      "section_3_desc": "Comprendre les performances des élèves et identifier les besoins d’apprentissage",
      "section_3_p1": "Afficher toutes les soumissions : consultez chaque tentative d'élève sur vos problèmes.",
      "section_3_p2": "Taux de réussite : suivez le pourcentage de tentatives aboutissant à des solutions acceptées.",
      "section_3_p3": "Erreurs courantes : identifiez les modèles d'erreurs des élèves - ils peuvent indiquer des énoncés de problèmes peu clairs.",
      "section_3_p4": "Distribution des verdicts : Comprenez pourquoi les élèves échouent (mauvaise réponse, délai d'attente, erreur de compilation, etc.).",
      "section_3_p5": "Langues utilisées : suivez les langages de programmation que les étudiants préfèrent.",
      "section_3_p6": "Données de performances : consultez le temps d'exécution et l'utilisation de la mémoire - identifiez si vos limites sont appropriées.",
      "section_3_p7": "Étudiants en difficulté : identifiez les élèves qui éprouvent des difficultés et qui pourraient avoir besoin d’un soutien supplémentaire.",
      "section_3_p8": "Résolveurs rapides : récompensez les étudiants qui résolvent des problèmes rapidement et efficacement.",
      "section_3_p9": "Utilisez ces données pour affiner vos énoncés de problèmes et ajuster la difficulté si nécessaire.",
      "section_4_title": "4. Utiliser CodeFix AI dans votre classe",
      "section_4_desc": "Intégrer la plateforme dans votre enseignement",
      "section_4_p1": "Ensembles de problèmes : créez des ensembles de problèmes sélectionnés pour chaque leçon ou sujet.",
      "section_4_p2": "Difficulté progressive : classez les problèmes pour augmenter progressivement le défi à mesure que les élèves s'améliorent.",
      "section_4_p3": "Devoirs : attribuez des problèmes spécifiques et utilisez les données de soumission pour suivre leur achèvement.",
      "section_4_p4": "Apprentissage par les pairs : encouragez les élèves à expliquer leurs solutions à leurs camarades de classe.",
      "section_4_p5": "Pratique de débogage : utilisez les soumissions ayant échoué comme moments d'enseignement - analysez pourquoi les solutions ont échoué."
    },
    "adminGuideDesc": "Découvrez comment gérer la plateforme CodeFix AI et administrer toutes les ressources système",
    "teacherGuideDesc": "Apprenez à créer efficacement des problèmes et à gérer l'apprentissage de vos élèves",
    "goToAdminPanel": "Accédez au panneau d'administration",
    "goToTeacherDashboard": "Accédez au tableau de bord de l'enseignant",
    "needMoreHelp": "Besoin de plus d'aide ?",
    "helpDescription": "Consultez le guide d’instructions principal ou contactez le support pour obtenir une assistance technique.",
    "viewMainGuide": "📖 Voir le guide principal",
    "backToHome": "Retour à la maison",
    "quickNavigation": "Navigation rapide",
    "keyPoints": "Points clés :",
    "screenshotPlaceholder": "[Une capture d'écran sera ajoutée ici]",
    "adminOverview": "Présentation du panneau d'administration",
    "manageUsers": "Gestion des utilisateurs",
    "manageProblem": "Gérer les problèmes",
    "reviewSubmissions": "Examen des soumissions",
    "teacherDashboard": "Tableau de bord de l'enseignant (rôle ENSEIGNANT)",
    "analyticsStatistics": "Analyses et statistiques",
    "adminBestPractices": "Meilleures pratiques pour les administrateurs",
    "adminTroubleshooting": "Dépannage des problèmes courants",
    "teacherGettingStarted": "Débuter en tant qu'enseignant",
    "teacherCreatingProblems": "Créer et gérer des problèmes",
    "teacherAnalyzingSubmissions": "Analyser les soumissions des étudiants",
    "teacherClassroomIntegration": "Utiliser CodeFix AI dans votre classe",
    "teacherAnalytics": "Suivi des progrès des étudiants",
    "teacherCollaboration": "Collaborer avec d'autres enseignants",
    "teacherAdvancedTips": "Conseils avancés pour un enseignement efficace",
    "teacherTroubleshooting": "Dépannage des problèmes d'enseignement courants",
    "proTip": "Conseil de pro",
    "proTip_1": "Testez votre code localement AVANT de le soumettre pour détecter rapidement les erreurs évidentes.",
    "proTip_2": "Les commentaires de l'IA apprennent en analysant votre code : lisez-le attentivement et appliquez les suggestions à votre prochaine tentative.",
    "proTip_3": "Parfois, de petits détails comptent : les nouvelles lignes finales, les espaces, la majuscule exacte. Lisez très attentivement le format de sortie attendu.",
    "proTip_4": "Ne sautez pas trop vite sur les problèmes difficiles. Construisez d’abord vos fondations avec des problèmes faciles.",
    "proTip_5": "Chaque mauvaise soumission est un apprentissage - gardez une trace des erreurs que vous faites et essayez de ne pas les répéter.",
    "faqTitle": "Foire aux questions",
    "faq_1_question": "Q : Puis-je utiliser des bibliothèques externes ou des importations ?",
    "faq_1_answer": "R : La plupart des bibliothèques standards sont autorisées. Cependant, évitez les packages externes qui ne sont pas dans la bibliothèque standard. Tenez-vous-en aux fonctions et aux structures de données intégrées.",
    "faq_2_question": "Q : Que signifie « Délai dépassé » ?",
    "faq_2_answer": "R : Votre code prend trop de temps à s’exécuter. Vous devez optimiser votre algorithme : soit en utilisant un algorithme plus rapide, soit en améliorant l'efficacité de votre implémentation. Vérifiez les contraintes pour comprendre la taille de l'entrée.",
    "faq_3_question": "Q : Comment déboguer mon code ?",
    "faq_3_answer": "R : Testez d'abord les exemples d'entrées sur votre propre ordinateur. Ajoutez des instructions d'impression pour voir quelles valeurs ont vos variables. Consultez les commentaires de l'IA pour obtenir des indices sur ce qui ne va pas.",
    "faq_4_question": "Q : Combien de fois puis-je soumettre ?",
    "faq_4_answer": "R : Vous pouvez soumettre autant de fois que vous le souhaitez, mais il existe une limite de débit (généralement 5 soumissions par minute et par utilisateur) pour éviter les abus.",
    "faq_5_question": "Q : Quelle est la différence entre une « mauvaise réponse » et un résultat incorrect ?",
    "faq_5_answer": "R : « Mauvaise réponse » signifie que votre résultat ne correspond pas exactement. Il peut s'agir de valeurs erronées, d'un format incorrect, d'espaces supplémentaires, de nouvelles lignes manquantes ou de tout ce qui diffère du résultat attendu. Vérifiez le format exact requis.",
    "faq_6_question": "Q : Dois-je mémoriser les solutions ?",
    "faq_6_answer": "R : Non ! Comprendre l’approche est bien plus précieux. Essayez de résoudre les problèmes vous-même, et si vous êtes bloqué, regardez l'explication et essayez de la mettre en œuvre. Apprendre la technique compte plus que mémoriser les réponses.",
    "title": "Comment utiliser CodeFix AI",
    "subtitle": "Un guide complet pour démarrer et maîtriser la plateforme",
    "section_1_title": "1. Pour commencer",
    "section_1_desc": "Vos premiers pas sur la plateforme CodeFix AI",
    "section_1_p1": "Bienvenue dans CodeFix AI ! Ce guide vous aidera à naviguer sur la plateforme et à résoudre efficacement les problèmes de codage.",
    "section_1_p2": "CodeFix AI est une plateforme de jugement en ligne qui vous aide à pratiquer la programmation à travers des défis de codage sélectionnés.",
    "section_1_p3": "Chaque problème comprend une description détaillée, des exemples de cas de test et une évaluation automatique de vos soumissions.",
    "section_1_p4": "Vous pouvez soumettre des solutions dans plusieurs langages de programmation : Python, C++ et JavaScript.",
    "section_1_p5": "La plateforme fournit un retour instantané sur vos soumissions avec des messages d'erreur détaillés.",
    "section_2_title": "2. Comprendre les problèmes",
    "section_2_desc": "Apprenez à lire et à comprendre les énoncés de problèmes",
    "section_2_p1": "Chaque problème comporte un énoncé clair décrivant ce que vous devez accomplir.",
    "section_2_p2": "Faites attention à la section Format d'entrée/sortie - ceci est crucial pour des solutions correctes.",
    "section_2_p3": "Lisez attentivement les contraintes : elles vous indiquent les plages valides pour les entrées et l'efficacité attendue de la solution.",
    "section_2_p4": "Des exemples de cas de test montrent des exemples d'entrée et de sortie attendue pour le problème.",
    "section_2_p5": "Des cas de test masqués seront utilisés pour évaluer votre solution après soumission.",
    "section_2_p6": "Le niveau de difficulté (Facile/Moyen/Difficile) vous aide à choisir des problèmes adaptés à votre niveau de compétence.",
    "section_3_title": "3. Rédiger votre solution",
    "section_3_desc": "Meilleures pratiques pour écrire du code correct et efficace",
    "section_3_p1": "Commencez par comprendre complètement le problème avant d’écrire du code.",
    "section_3_p2": "Testez d’abord votre solution avec les exemples de cas fournis.",
    "section_3_p3": "Pensez aux cas extrêmes : entrées vides, très grands nombres, caractères spéciaux, etc.",
    "section_3_p4": "Écrivez du code propre et lisible avec des noms de variables significatifs.",
    "section_3_p5": "Commentez votre logique, en particulier pour les algorithmes complexes.",
    "section_3_p6": "Optimisez à la fois l’exactitude et l’efficacité dans les limites de temps et de mémoire.",
    "section_4_title": "4. Soumission de votre code",
    "section_4_desc": "Comment soumettre et suivre vos soumissions",
    "section_4_p1": "Sélectionnez votre langage de programmation dans le menu déroulant.",
    "section_4_p2": "Collez ou chargez votre code dans l'éditeur.",
    "section_4_p3": "Cliquez sur le bouton Soumettre pour tester votre solution par rapport à tous les cas de test.",
    "section_4_p4": "Vous pouvez faire plusieurs soumissions – il n’y a aucune pénalité pour essayer.",
    "section_4_p5": "Chaque soumission est horodatée et stockée dans votre historique de soumission.",
    "section_4_p6": "Le verdict indique si votre solution a réussi tous les cas de test ou si elle a échoué.",
    "section_5_title": "5. Comprendre les commentaires",
    "section_5_desc": "Comment interpréter les résultats et les commentaires de CodeFix AI",
    "section_5_p1": "ACCEPTÉ : votre solution a réussi tous les cas de test ! Félicitations!",
    "section_5_p2": "WRONG_ANSWER : votre sortie ne correspond pas au résultat attendu pour certains scénarios de test.",
    "section_5_p3": "TIME_LIMIT_EXCEEDED : l'exécution de votre solution a pris trop de temps : optimisez votre algorithme.",
    "section_5_p4": "MEMORY_LIMIT_EXCEEDED : Votre solution a utilisé trop de mémoire : réduisez les structures de données ou optimisez-les.",
    "section_5_p5": "COMPILATION_ERROR : Il y a une erreur de syntaxe dans votre code – vérifiez la syntaxe de votre langage.",
    "section_5_p6": "RUNTIME_ERROR : votre programme est tombé en panne - vérifiez la division par zéro, le tableau hors limites, etc.",
    "section_5_p7": "Utilisez ces commentaires pour améliorer votre solution et réessayez.",
    "section_6_title": "6. Stratégies de débogage",
    "section_6_desc": "Techniques pour trouver et corriger les bugs dans votre code",
    "section_6_p1": "Ajoutez des instructions d'impression/console pour suivre les valeurs des variables pendant l'exécution.",
    "section_6_p2": "Testez d'abord avec les exemples de cas - si ceux-ci échouent, votre logique est définitivement fausse.",
    "section_6_p3": "Créez vos propres cas de test, en particulier les cas extrêmes comme les entrées vides ou les contraintes maximales.",
    "section_6_p4": "Parcourez votre code manuellement avec un scénario de test pour voir ce qu'il fait réellement.",
    "section_6_p5": "Utilisez un débogueur si votre IDE le prend en charge – parcourez le code ligne par ligne.",
    "section_6_p6": "Relisez à nouveau l'énoncé du problème : vous avez peut-être mal compris une exigence.",
    "section_6_p7": "Recherchez les erreurs une par une, en particulier dans les boucles et l'indexation des tableaux.",
    "section_7_title": "7. Optimisation des performances",
    "section_7_desc": "Écrire des solutions efficaces qui s'exécutent dans les limites de temps et de mémoire",
    "section_7_p1": "Choisissez les structures de données appropriées : utilisez des cartes de hachage pour les recherches O(1), pas pour les listes.",
    "section_7_p2": "Comprendre la complexité du Big O : O(n²) fonctionne pour n≤1000, mais O(n log n) est meilleur pour le grand n.",
    "section_7_p3": "Évitez les boucles imbriquées lorsque cela est possible : elles multiplient la complexité temporelle.",
    "section_7_p4": "Utilisez la résiliation anticipée : sortez des boucles lorsque vous trouvez ce que vous cherchez.",
    "section_7_p5": "Profilez votre code : mesurez où le temps est réellement passé avant de l'optimiser.",
    "section_7_p6": "Lisez les contraintes pour comprendre quel niveau d'optimisation est nécessaire.",
    "section_7_p7": "Parfois, un algorithme plus simple et plus clair est assez rapide – n’en faites pas trop.",
    "section_8_title": "8. Erreurs courantes",
    "section_8_desc": "Les pièges à éviter lors de la résolution de problèmes",
    "section_8_p1": "Ignorer le dépassement d'entier : les calculs volumineux peuvent dépasser les limites des types de données.",
    "section_8_p2": "Utilisation incorrecte de l'indexation basée sur 1 ou basée sur 0 - sachez quels tableaux commencent à 0.",
    "section_8_p3": "Ne pas gérer les nombres négatifs ou zéro comme cas particuliers.",
    "section_8_p4": "Oublier les nouvelles lignes dans la sortie ou avoir des espaces supplémentaires.",
    "section_8_p5": "En supposant que les contraintes sont plus petites que celles indiquées, testez toujours avec des valeurs maximales.",
    "section_8_p6": "Des erreurs logiques comme l'utilisation de AND lorsque vous voulez dire OR, ou vice versa.",
    "section_8_p7": "Ne pas prendre en compte les problèmes de précision en virgule flottante dans les problèmes mathématiques.",
    "section_8_p8": "Soumettre sans tester avec des exemples de cas au préalable.",
    "section_9_title": "9. Meilleures pratiques",
    "section_9_desc": "Des habitudes de codage professionnelles qui mènent au succès",
    "section_9_p1": "Commencez toujours par un plan : pseudocode ou algorithme avant le code réel.",
    "section_9_p2": "Utilisez le contrôle de version : gardez une trace de vos solutions pour référence future.",
    "section_9_p3": "Commentez votre code : à l'avenir vous remercierez de vous présenter.",
    "section_9_p4": "Testez minutieusement : exemples de cas, cas extrêmes et tests de résistance.",
    "section_9_p5": "Refactorisez après résolution : rendez votre code plus propre et plus efficace.",
    "section_9_p6": "Apprenez des autres : lisez les solutions acceptées pour découvrir différentes approches.",
    "section_9_p7": "Entraînez-vous régulièrement : une pratique constante améliore les compétences en résolution de problèmes.",
    "section_9_p8": "Ne vous contentez pas de mémoriser les solutions : comprenez les concepts sous-jacents.",
    "section_10_title": "10. Conseils spécifiques à la langue",
    "section_10_desc": "Considérations importantes pour Python, C++ et JavaScript",
    "section_10_p1": "Python : utilisez des fonctions et des bibliothèques intégrées (collections, itertools) pour plus d'efficacité.",
    "section_10_p2": "C++ : n'oubliez pas d'inclure tous les en-têtes nécessaires et surveillez les débordements d'entiers.",
    "section_10_p3": "JavaScript : n'oubliez pas que les nombres en JS peuvent présenter des problèmes de précision : utilisez BigInt pour les grands entiers.",
    "section_10_p4": "Toutes les langues : faites attention à la façon dont les chaînes sont traitées et comparées.",
    "section_10_p5": "Connaissez la bibliothèque standard de votre langue – ne réinventez pas la roue.",
    "section_10_p6": "Apprenez le modèle typique de programmation compétitive dans votre langue."
  },
  "auth": {
    "login": "Se connecter",
    "loginHint": "Content de te revoir! Connectez-vous pour continuer.",
    "register": "Registre",
    "registerHint": "Créez un nouveau compte pour commencer.",
    "username": "Nom d'utilisateur",
    "password": "Mot de passe",
    "haveAccount": "Vous avez déjà un compte ?",
    "noAccount": "Vous n'avez pas de compte ?",
    "invalid": "Nom d'utilisateur ou mot de passe invalide",
    "registerFailed": "L'enregistrement a échoué. Le nom d'utilisateur est peut-être déjà pris.",
    "loading": "Chargement...",
    "logout": "Déconnexion",
    "profile": "Profil"
  },
  "profile": {
    "statistics": "Vos statistiques",
    "totalSubmissions": "Total des soumissions",
    "accepted": "Accepté",
    "failed": "Échoué",
    "pending": "En attente",
    "acceptanceRate": "Taux d'acceptation",
    "role": "Rôle",
    "userId": "ID de l'utilisateur",
    "account": "Compte",
    "quickLinks": "Liens rapides",
    "viewProblems": "Afficher les problèmes",
    "mySubmissions": "Mes soumissions",
    "globalStats": "Statistiques mondiales",
    "guide": "Guide"
  },
  "stats": {
    "labels": {
      "accepted": "CA",
      "ofTotal": "du total",
      "unit": {
        "ms": "MS",
        "mb": "Mo"
      }
    },
    "title": "Statistiques de la plateforme",
    "subtitle": "Aperçu global des soumissions, des langues et des mesures de performances",
    "totalSubmissions": "Total des soumissions",
    "submissions": "soumissions",
    "accepted": "Accepté",
    "acceptanceRate": "Taux d'acceptation",
    "averageTime": "Temps moyen",
    "averageMemory": "Mémoire moyenne",
    "peakMemory": "Mémoire maximale",
    "languageDistribution": "Distribution linguistique",
    "verdictDistribution": "Distribution des verdicts",
    "topContributors": "Meilleurs contributeurs",
    "rank": "Rang",
    "user": "Utilisateur",
    "rate": "Taux de réussite"
  },
  "home": {
    "welcomeTitle": "Bienvenue dans CodeFix AI",
    "welcomeDescription": "Maîtrisez vos compétences en codage grâce aux commentaires basés sur l'IA. Entraînez-vous aux problèmes, obtenez une analyse instantanée et améliorez vos capacités de programmation.",
    "startPracticing": "Commencez à pratiquer",
    "viewGuide": "Voir le guide",
    "signIn": "Se connecter",
    "signUp": "S'inscrire",
    "notLoggedIn": "Prêt à commencer à coder ?",
    "notLoggedInDesc": "Connectez-vous ou créez un compte pour démarrer avec CodeFix AI.",
    "solveProblems": "Résoudre les problèmes",
    "solveProblemsDesc": "Entraînez-vous avec des problèmes de codage sélectionnés dans différents niveaux de difficulté.",
    "aiFeedback": "Commentaires sur l'IA",
    "aiFeedbackDesc": "Obtenez une analyse intelligente de votre code et des conseils spécifiques pour l'améliorer.",
    "trackProgress": "Suivre les progrès",
    "trackProgressDesc": "Surveillez vos soumissions et vos améliorations au fil du temps.",
    "gettingStarted": "Commencer",
    "gettingStartedDesc": "Suivez notre guide du débutant pour apprendre à utiliser efficacement CodeFix AI.",
    "howItWorks": "Comment ça marche",
    "chooseProblem": "Choisissez un problème",
    "chooseProblemDesc": "Parcourez notre bibliothèque de problèmes et sélectionnez-en un qui correspond à votre niveau de compétence.",
    "writeSolveSubmit": "Écrire et soumettre",
    "writeSolveSubmitDesc": "Écrivez votre solution et soumettez-la pour être testée par rapport à des cas de test.",
    "getAiFeedback": "Obtenez des commentaires sur l'IA",
    "getAiFeedbackDesc": "Recevez des commentaires instantanés et personnalisés pour vous aider à vous améliorer.",
    "readyToStart": "Prêt à commencer ?",
    "readyToStartDesc": "Que vous soyez un débutant complet ou que vous cherchiez à perfectionner vos compétences, CodeFix AI est là pour vous aider à réussir.",
    "browseProblems": "Parcourir les problèmes",
    "viewTutorial": "📚 Voir le didacticiel",
    "teacher": "Professeur",
    "admin": "Administrateur"
  },
  "admin": {
    "problems": {
      "title": "Gestion des problèmes",
      "createButton": "+ Créer un problème",
      "columns": {
        "id": "IDENTIFIANT",
        "title": "Titre",
        "difficulty": "Difficulté",
        "limits": "Limites",
        "data": "Données",
        "testcases": "Cas de test",
        "statistics": "Statistiques"
      },
      "editData": "Modifier les données",
      "editTestcases": "Modifier les cas de test"
    },
    "problemEditor": {
      "editing": "Édition",
      "formLabels": {
        "title": "Titre",
        "description": "Description",
        "difficulty": "Difficulté"
      },
      "difficultyOptions": {
        "easy": "Facile",
        "medium": "Moyen",
        "hard": "Dur"
      },
      "metadata": {
        "testcaseSet": "Ensemble de cas de test",
        "created": "Créé",
        "updated": "Mis à jour"
      },
      "goToTestcases": "Aller aux cas de test"
    },
    "statementEditor": {
      "markdown": "Réduction",
      "preview": "Aperçu",
      "placeholder": "Écrivez l'énoncé du problème dans Markdown. Utilisez $x^2$ pour les mathématiques."
    },
    "testcaseEditor": {
      "visibilityOptions": {
        "private": "Privé",
        "sample": "Échantillon"
      },
      "labels": {
        "input": "Saisir",
        "output": "Résultat attendu"
      },
      "addTestcase": "Ajouter un cas de test",
      "removeTestcase": "Retirer"
    },
    "createProblem": {
      "heading": "Créer un problème",
      "formLabels": {
        "title": "Titre",
        "problemId": "ID du problème",
        "difficulty": "Difficulté"
      },
      "difficultyOptions": {
        "easy": "Facile",
        "medium": "Moyen",
        "hard": "Dur"
      },
      "submitButton": "Créer"
    },
    "submissions": {
      "confirmDelete": "Êtes-vous sûr de vouloir supprimer cette soumission ?"
    },
    "users": "Gestion des utilisateurs"
  },
  "filter": {
    "languages": {
      "python": "Python",
      "java": "Java",
      "javascript": "Javascript",
      "cpp": "C++"
    },
    "verdicts": {
      "runtimeError": "RE (erreur d'exécution)",
      "compilationError": "CE (Erreur de compilation)"
    }
  },
  "createProblem": {
    "heading": "Créer un problème",
    "title": "Créer un problème",
    "formLabels": {
      "title": "Titre",
      "problemId": "ID du problème",
      "difficulty": "Difficulté"
    },
    "difficultyOptions": {
      "easy": "Facile",
      "medium": "Moyen",
      "hard": "Dur"
    },
    "submitButton": "Créer"
  },
  "submissionFilter": {
    "languages": {
      "python": "Python",
      "cpp": "C++",
      "java": "Java",
      "javascript": "Javascript"
    },
    "verdicts": {
      "ac": "AC (Accepté)",
      "wa": "WA (mauvaise réponse)",
      "re": "RE (erreur d'exécution)",
      "tle": "TLE (Délai)",
      "mle": "MLE (limite de mémoire)",
      "ce": "CE (Erreur de compilation)"
    }
  },
  "statsPage": {
    "accepted": "CA",
    "ofTotal": "du total",
    "ms": "MS",
    "mb": "Mo"
  },
  "teacher": {
    "nav": {
      "myProblems": "Mes problèmes",
      "studentSubmissions": "Soumissions des étudiants",
      "analytics": "Analytique"
    },
    "myProblems": {
      "title": "Mes problèmes",
      "noProblems": "Vous n'avez encore créé aucun problème.",
      "columns": {
        "title": "Titre",
        "difficulty": "Difficulté",
        "submissions": "Soumissions",
        "accepted": "Accepté",
        "created": "Créé",
        "actions": "Actes"
      },
      "edit": "Modifier",
      "viewSubmissions": "Soumissions"
    },
    "studentSubmissions": {
      "title": "Soumissions des étudiants",
      "noSubmissions": "Aucune soumission d'étudiant pour l'instant.",
      "columns": {
        "id": "IDENTIFIANT",
        "userId": "ID de l'utilisateur",
        "language": "Langue",
        "verdict": "Verdict",
        "submitted": "Soumis",
        "actions": "Actes"
      },
      "view": "Voir"
    },
    "analytics": {
      "title": "Analytique",
      "summary": "Résumé",
      "totalProblems": "Problèmes totaux",
      "totalSubmissions": "Total des soumissions",
      "accepted": "Accepté",
      "rejected": "Rejeté",
      "pending": "En attente",
      "acceptanceRate": "Taux d'acceptation",
      "summaryText": "Vous avez créé <strong>{{problems}></strong> problème(s) avec <strong>{{submissions}></strong> soumission(s) totale(s) d'élèves.",
      "acceptanceRateText": "Taux d'acceptation global : <strong>{{rate}} %</strong>"
    }
  },
  "adminPanel": {
    "title": "Tableau de bord d'administration",
    "totalUsers": "Nombre total d'utilisateurs",
    "totalSubmissions": "Total des soumissions",
    "acceptedSubmissions": "Soumissions acceptées",
    "problems": "Gestion des problèmes",
    "viewAll": "Tout afficher",
    "submissions": "Soumissions",
    "id": "IDENTIFIANT",
    "username": "Nom d'utilisateur",
    "role": "Rôle",
    "joined": "Rejoint",
    "actions": "Actes",
    "view": "Voir",
    "delete": "Supprimer",
    "loading": "Chargement",
    "previous": "← Précédent",
    "next": "Suivant →",
    "page": "Page",
    "of": "de",
    "roleOptions": {
      "user": "Utilisateur",
      "student": "Étudiant",
      "teacher": "Professeur",
      "admin": "Administrateur"
    },
    "tableHeaders": {
      "verdict": "Verdict",
      "userId": "ID de l'utilisateur",
      "problemId": "ID du problème",
      "submittedAt": "Soumis à"
    }
  },
  "users": {
    "searchDescription": "Recherchez des utilisateurs et consultez leurs profils",
    "noResults": "Aucun utilisateur trouvé correspondant à votre recherche",
    "found": "utilisateur(s) trouvé(s)"
  },
  "about": {
    "title": "À propos de CodeFix AI",
    "tagline": "Apprenez à coder par la résolution compétitive de problèmes",
    "section1Title": "Qu'est-ce que CodeFix AI?",
    "section1Content": "CodeFix AI est une plateforme de jugement en ligne où vous pouvez pratiquer des problèmes de codage, soumettre des solutions et obtenir des commentaires instantanés. Que vous soyez un débutant apprenant les bases ou un programmeur expérimenté perfectionnant vos compétences, CodeFix AI fournit des problèmes de niveaux de difficulté variés.",
    "section2Title": "Caractéristiques",
    "feature1": "Des centaines de problèmes de codage dans plusieurs catégories",
    "feature2": "Support pour plusieurs langages de programmation",
    "feature3": "Jugement en temps réel et commentaires détaillés",
    "feature4": "Classements et statistiques de performance",
    "feature5": "Analyses de résolution de problèmes et informations",
    "feature6": "Tableau de bord pour les enseignants pour gérer les salles de classe",
    "section3Title": "Comment commencer",
    "step1": "Créez un compte pour suivre votre progression",
    "step2": "Parcourez les problèmes par difficulté et catégorie",
    "step3": "Soumettez vos solutions dans votre langage préféré",
    "step4": "Obtenez des commentaires instantanés et améliorez votre code",
    "section4Title": "Pour les enseignants",
    "teacherContent": "CodeFix AI fournit une plateforme complète pour que les éducateurs créent des problèmes, gèrent les soumissions des étudiants et suivent la progression de l'apprentissage avec une analyse détaillée.",
    "contactTitle": "Contact et support",
    "contactContent": "Pour toute question ou commentaire, veuillez contacter notre communauté ou consulter la documentation."
  },
  "contests": {
    "title": "Concours de Programmation",
    "subtitle": "Concourrez avec d'autres et améliorez vos compétences en codage",
    "create": "Créer un Concours",
    "status": {
      "all": "Tous les Concours",
      "upcoming": "À venir",
      "ongoing": "En cours",
      "finished": "Terminé"
    },
    "empty": "Aucun concours trouvé. Revenez bientôt !",
    "notFound": "Concours introuvable",
    "starts": "Commence",
    "ends": "Se termine",
    "public": "Public",
    "private": "Privé",
    "view": "Voir les détails",
    "details": "Voir les détails",
    "register": "S'inscrire Maintenant",
    "problems": "Problèmes",
    "standings": "Classement",
    "noProblems": "Aucun problème dans ce concours",
    "noStandings": "Aucun classement disponible pour le moment",
    "participant": "Participant",
    "solved": "Résolus",
    "penalty": "Pénalité",
    "backToList": "Retour aux Concours",
    "status": "Statut",
    "time": "Heure"
  },
  "status": {
    "title": "État du Système",
    "subtitle": "Surveiller la santé des services backend",
    "serviceHealth": "Santé du Service",
    "backendServer": "Serveur Backend",
    "ollamaAiServer": "Serveur IA Ollama",
    "online": "En ligne",
    "offline": "Hors ligne",
    "checking": "Vérification...",
    "lastChecked": "Dernière vérification",
    "just_now": "à l'instant",
    "autoRefresh": "Actualisation automatique toutes les 10 secondes",
    "troubleshooting": "Guide de Dépannage",
    "backendsOffline": "Si le serveur Backend est hors ligne :",
    "backendOfflineStep1": "Vérifiez que le serveur backend s'exécute sur votre machine",
    "backendOfflineStep2": "Vérifiez que la variable d'environnement NEXT_PUBLIC_BACKEND_URL est définie correctement",
    "backendOfflineStep3": "Assurez-vous que le backend est accessible à l'URL configurée",
    "backendOfflineStep4": "Vérifiez les journaux backend pour les erreurs",
    "ollamaOffline": "Si le serveur IA Ollama est hors ligne :",
    "ollamaOfflineStep1": "Assurez-vous que Ollama est installé sur votre système",
    "ollamaOfflineStep2": "Démarrez Ollama avec : ollama serve",
    "ollamaOfflineStep3": "Vérifiez que OLLAMA_URL est défini correctement dans backend .env (par défaut : http://localhost:11434)",
    "ollamaOfflineStep4": "Assurez-vous qu'un modèle est téléchargé : ollama pull qwen2.5-coder:3b",
    "generalTroubleshooting": "Dépannage Général :",
    "generalTroubleshootingStep1": "Essayez d'actualiser la page pour revérifier l'état du service",
    "generalTroubleshootingStep2": "Effacez le cache de votre navigateur et les cookies",
    "generalTroubleshootingStep3": "Vérifiez votre connexion Internet",
    "generalTroubleshootingStep4": "Consultez les journaux backend et Ollama pour des messages d'erreur détaillés"
  },
  "backendWarning": {
    "title": "SERVEUR BACKEND INDISPONIBLE",
    "message": "Le serveur backend est actuellement indisponible. Certaines fonctionnalités peuvent ne pas fonctionner correctement.",
    "viewStatus": "Voir l'État",
    "close": "Fermer"
  }
}