{
  "common": {
    "loading": "Laden...",
    "error": "Fehler",
    "success": "Erfolg",
    "search": "Suchen",
    "clear": "Löschen",
    "save": "Speichern",
    "cancel": "Abbrechen"
  },
  "nav": {
    "problems": "Probleme",
    "submissions": "Einsendungen",
    "admin": "Admin-Panel",
    "teacher": "Lehrerpanel",
    "judge": "Richter",
    "login": "Login",
    "register": "Registrieren",
    "profile": "Profil",
    "logout": "Abmelden",
    "statistics": "Statistiken",
    "users": "Benutzer",
    "about": "Über"
  },
  "problems": {
    "title": "Probleme",
    "search_placeholder": "Suchprobleme…",
    "tags_placeholder": "Nach Tags suchen...",
    "category_placeholder": "Suche nach Kategorie...",
    "all_difficulties": "Alle Schwierigkeiten",
    "easy": "Einfach",
    "medium": "Medium",
    "hard": "Hart",
    "apply": "Anwenden",
    "difficulty": "Schwierigkeit"
  },
  "submissions": {
    "title": "Einsendungen",
    "status": "Status",
    "language": "Sprache",
    "time": "Zeit",
    "verdict": "Urteil",
    "all_languages": "Alle Sprachen",
    "all_verdicts": "Alle Urteile"
  },
  "submission_form": {
    "submit_solution": "Lösung einreichen",
    "language": "Sprache",
    "load_file": "Datei laden",
    "submit": "Einreichen",
    "submitting": "Einreichen...",
    "please_wait": "Bitte warten Sie, bevor Sie erneut absenden",
    "file_too_large": "Die Datei ist zu groß. Die maximale Größe beträgt {{size}} KB.",
    "failed_to_read": "Datei konnte nicht gelesen werden.",
    "cpp": "C++",
    "python": "Python",
    "javascript": "JavaScript"
  },
  "results": {
    "result": "Ergebnis",
    "cases": "Fälle",
    "ms": "MS",
    "kb": "KB",
    "test_cases": "Testfälle"
  },
  "submission_detail": {
    "title": "Vorlage",
    "problem": "Problem",
    "language": "Sprache",
    "id": "AUSWEIS",
    "source_code": "Quellcode (zum Anzeigen klicken)",
    "loading": "Einreichung wird geladen…"
  },
  "feedback": {
    "compilation_error": "Ihr Code weist einen Kompilierungsfehler auf. Einzelheiten finden Sie in der Checkliste.",
    "all_passed": "Großartig! Alle Testfälle bestanden!",
    "almost_there": "Fast geschafft! Ein Testfall ist fehlgeschlagen.",
    "some_failed": "{{failed}} Testfälle sind fehlgeschlagen. Versuchen Sie es weiter!",
    "none_passed": "Es wurden noch keine Testfälle bestanden. Überprüfen Sie Ihre Logik sorgfältig.",
    "runtime_error": "Ihr Programm ist zur Laufzeit abgestürzt. Überprüfen Sie Array-Grenzen und Nullreferenzen.",
    "slow_solution": "Ihre Lösung ist langsam. Erwägen Sie die Optimierung Ihres Algorithmus."
  },
  "problem_detail": {
    "title": "Problem",
    "statement": "Problemstellung",
    "time_limit": "Zeit",
    "memory_limit": "Erinnerung",
    "placeholder": "Platzhalter"
  },
  "table": {
    "id": "AUSWEIS",
    "user": "Benutzer",
    "problem": "Problem",
    "verdict": "Urteil",
    "language": "Sprache",
    "when": "Wann",
    "status": "Status",
    "time": "Zeit"
  },
  "submission": {
    "title": "Vorlage",
    "beginner_tips": "💡 Tipps für Anfänger",
    "analyzing": "Analysieren Sie Ihren Code...",
    "common_mistakes": "Häufige zu überprüfende Fehler:",
    "no_issues": "Keine Probleme festgestellt"
  },
  "checklist": {
    "syntax": "Syntax",
    "variables": "Variablen",
    "logic": "Logik",
    "types": "Typen",
    "type_conversion": "Typkonvertierung",
    "type_hints": "Geben Sie Hinweise ein",
    "type_coercion": "Geben Sie Zwang ein",
    "data_types": "Datentypen",
    "large_numbers": "Große Zahlen",
    "integer_overflow": "Ganzzahliger Überlauf",
    "indentation": "Vertiefung",
    "structure": "Struktur",
    "input_output": "Eingabe/Ausgabe",
    "linking": "Verlinkung",
    "methods": "Methoden",
    "arrays": "Arrays",
    "null_undefined": "Null/Undefiniert",
    "code_quality": "Codequalität"
  },
  "hints": {
    "cpp": {
      "syntax": "Fehlendes Semikolon oder fehlende Klammer – Kompilierungsfehlerzeile überprüfen",
      "variables": "Variable nicht deklariert – überprüfen Sie die Rechtschreibung und deklarieren Sie sie vor der Verwendung",
      "linking": "Funktion/Variable nicht verknüpft – prüfen Sie, ob alle Quelldateien kompiliert sind",
      "type_mismatch": "Typkonflikt – Überprüfen Sie, ob die Datentypen mit den Funktionsparametern übereinstimmen",
      "type_conversion": "Typ kann nicht konvertiert werden – explizite Umwandlung verwenden: (int)value, (double)value",
      "logic": "Testfall fehlgeschlagen – Algorithmus und Randbedingungen prüfen",
      "input_output": "Überprüfen Sie die Analyse des Eingabeformats und die Ausgabeformatierung",
      "data_types": "Überprüfen Sie, ob die Datentypen mit der Eingabe übereinstimmen (int vs. long long für große Zahlen).",
      "integer_overflow": "Auf Überlauf prüfen: Der int-Bereich liegt bei ~-2B bis +2B. Verwenden Sie long long für größere Werte",
      "code_quality": "Erwägen Sie bei Bedarf eine Optimierung für große Eingaben"
    },
    "python": {
      "indentation": "Einrückung korrigieren – einheitliche Abstände sicherstellen (normalerweise 4 Leerzeichen)",
      "syntax": "Syntaxfehler – Doppelpunkte nach if/for/while/def/class überprüfen",
      "variables": "Variable nicht definiert – Rechtschreibung und Umfang prüfen",
      "types": "Typfehler – Typkonvertierungen prüfen (int(), str() usw.)",
      "type_hints": "Tipp: Verwenden Sie int(input()) für Zahlen, input() gibt standardmäßig str zurück",
      "index_error": "Index außerhalb des gültigen Bereichs – Array-Grenzen überprüfen",
      "methods": "Methode existiert nicht – überprüfen Sie den Objekttyp und die verfügbaren Methoden",
      "type_conversion": "Wert kann nicht konvertiert werden – z. B. schlägt int('abc') fehl. Überprüfen Sie, ob die Eingabe gültig ist",
      "logic": "Testfall fehlgeschlagen – Algorithmuslogik überprüfen",
      "data_types": "Tipp: Denken Sie daran, dass int/float/str unterschiedlich sind. int('123') != '123'",
      "large_numbers": "Python verarbeitet große Ganzzahlen automatisch, prüft jedoch auf Endlosschleifen oder Rekursionen",
      "code_quality": "Großartig! Alle Tests bestanden"
    },
    "javascript": {
      "syntax": "Syntaxfehler – überprüfen Sie Klammern, geschweifte Klammern und runde Klammern",
      "variables": "Variable nicht definiert – mit const/let/var deklarieren",
      "types": "Typfehler – Variablentypen und Funktionsaufrufe prüfen",
      "type_coercion": "Tipp: Verwenden Sie ===, nicht ==. '5' == 5 ist wahr, aber '5' === 5 ist falsch",
      "null_undefined": "Null- oder undefinierter Fehler – prüfen Sie, ob der Wert vorhanden ist, bevor Sie ihn verwenden",
      "nan": "Habe NaN (keine Zahl) erhalten – stellen Sie sicher, dass Zeichenfolgen korrekt in Zahlen umgewandelt werden: Number(x) oder parseInt(x)",
      "logic": "Der Test ist fehlgeschlagen. Überprüfen Sie die Logik des Algorithmus",
      "data_types": "Tipp: Merken Sie sich „123“ (Zeichenfolge) != 123 (Zahl). Verwenden Sie Number() zum Konvertieren",
      "large_numbers": "Für Zahlen > 2^53 verwenden Sie BigInt: BigInt(9007199254740991) oder 123n",
      "code_quality": "Exzellent! Alle Tests bestanden"
    }
  },
  "sample_cases": {
    "title": "Beispieleingabe/-ausgabe",
    "sample": "Probe",
    "input": "Eingang",
    "output": "Ausgabe",
    "copy": "Kopie",
    "copied": "Kopiert!"
  },
  "load_more": "Mehr laden",
  "pagination": {
    "previous": "Vorherige",
    "next": "Nächste",
    "page": "Seite"
  },
  "guide": {
    "adminTeacherGuide": "Leitfaden für Administratoren und Lehrer",
    "adminGuide": {
      "section_1_title": "1. Übersicht über das Admin-Panel",
      "section_1_desc": "Verstehen Sie Ihre administrativen Verantwortlichkeiten und Fähigkeiten",
      "section_1_p1": "Das Admin-Panel ist eine leistungsstarke Verwaltungsoberfläche zur Überwachung der gesamten CodeFix AI-Plattform.",
      "section_1_p2": "Als Administrator haben Sie die volle Kontrolle über Benutzer, Probleme und Einsendungen.",
      "section_1_p3": "Sie können Benutzerrollen verwalten, Probleme erstellen und ändern, Einreichungen löschen und umfassende Statistiken anzeigen.",
      "section_1_p4": "Alle Verwaltungsaktionen werden aus Sicherheits- und Prüfgründen protokolliert.",
      "section_1_p5": "Das Admin-Dashboard bietet Echtzeit-Einblicke in die Plattformnutzung und -leistung.",
      "section_1_p6": "Greifen Sie über das Hauptnavigationsmenü auf das Admin-Panel zu – nur Administratoren können diese Option sehen.",
      "section_2_title": "2. Benutzer verwalten",
      "section_2_desc": "So verwalten Sie Benutzerkonten, Rollen und Berechtigungen",
      "section_2_p1": "Im Bereich „Benutzer“ werden alle auf der Plattform registrierten Benutzer mit ihren Daten angezeigt.",
      "section_2_p2": "Sie können Benutzer anhand des Benutzernamens, der ID oder anderer Kriterien suchen, um schnell bestimmte Konten zu finden.",
      "section_2_p3": "Rollenverwaltung: Ändern Sie die Rolle eines beliebigen Benutzers zwischen BENUTZER, STUDENT, LEHRER oder ADMIN.",
      "section_2_p4": "BENUTZER: Normale Benutzer können nur Probleme lösen und ihre eigenen Beiträge einsehen.",
      "section_2_p5": "STUDENT: Studierende haben die gleichen Berechtigungen wie Benutzer, sind jedoch für die Kursverfolgung markiert.",
      "section_2_p6": "LEHRER: Lehrer können Probleme erstellen und verwalten, Schülerbeiträge zu ihren Problemen einsehen und auf Analysen zugreifen.",
      "section_2_p7": "ADMIN: Voller Systemzugriff. Aus Sicherheitsgründen können nur bestehende Administratoren Benutzer in den Administratorstatus befördern.",
      "section_2_p8": "Durch die Paginierung können Sie effizient durch große Benutzerlisten navigieren.",
      "section_2_p9": "In jedem Benutzerdatensatz werden zum schnellen Nachschlagen das Beitrittsdatum und die aktuelle Rolle angezeigt.",
      "section_3_title": "3. Probleme verwalten",
      "section_3_desc": "Codierungsprobleme erstellen, bearbeiten und entfernen",
      "section_3_p1": "Im Abschnitt „Probleme“ können Sie die gesamte Problembibliothek verwalten.",
      "section_3_p2": "Neue Probleme erstellen: Klicken Sie auf „Problem erstellen“, um der Plattform neue Codierungsherausforderungen hinzuzufügen.",
      "section_3_p3": "Problemdaten bearbeiten: Problemtitel, Beschreibungen, Aussagen, Schwierigkeitsgrade und Ressourcengrenzen ändern.",
      "section_3_p4": "Testfälle bearbeiten: Testfälle hinzufügen, aktualisieren oder entfernen, die Benutzereingaben validieren.",
      "section_3_p5": "Schwierigkeitsgrade: Stellen Sie Probleme als EINFACH, MITTEL oder SCHWER ein, um Benutzern die Suche nach geeigneten Herausforderungen zu erleichtern.",
      "section_3_p6": "Ressourcenlimits: Konfigurieren Sie Zeitlimits (Millisekunden) und Speicherlimits (Megabyte) für jedes Problem.",
      "section_3_p7": "Sichtbarkeit: Steuern Sie, welche Benutzer jedes Problem sehen können (veröffentlicht vs. Entwurf).",
      "section_3_p8": "Problemstatistik: Sehen Sie, wie viele Benutzer jedes Problem gelöst haben und wie hoch die Akzeptanzrate der Lösung ist.",
      "section_3_p9": "Probleme löschen: Entfernen Sie Probleme, die nicht mehr relevant sind (dadurch werden auch zugehörige Einsendungen gelöscht).",
      "section_3_p10": "Suchen und Filtern: Finden Sie Probleme schnell nach Titel, Schwierigkeitsgrad oder Kategorie.",
      "section_4_title": "4. Überprüfung der Einreichungen",
      "section_4_desc": "Überwachen und verwalten Sie Benutzerbeiträge",
      "section_4_p1": "Im Abschnitt „Einreichungen“ werden alle Codeeinreichungen von Benutzern für alle Probleme angezeigt.",
      "section_4_p2": "Filtern Sie Einsendungen nach Urteilsstatus: AKZEPTIERT, FALSCHE_ANTWORT, TIME_LIMIT_EXCEEDED, COMPILATION_ERROR usw.",
      "section_4_p3": "Zeigen Sie detaillierte Informationen zu jeder Einreichung an, einschließlich Benutzer, Problem, Sprache und Zeitstempel.",
      "section_4_p4": "Leistungsmetriken: Sehen Sie sich die Ausführungszeit und die Speichernutzung für jede Übermittlung an.",
      "section_4_p5": "Quellcode anzeigen: Klicken Sie auf eine beliebige Einsendung, um den Code des Benutzers zu überprüfen.",
      "section_4_p6": "Einsendungen löschen: Einsendungen entfernen (nützlich, um die Datenbanksauberkeit aufrechtzuerhalten oder unangemessene Inhalte zu behandeln).",
      "section_4_p7": "Aufschlüsselung des Urteils: Verstehen Sie anhand farbiger Statusanzeigen, warum Einreichungen fehlgeschlagen sind.",
      "section_4_p8": "Die Paginierung hilft bei der effizienten Verwaltung großer Einreichungslisten.",
      "section_4_p9": "Daten exportieren: Verwenden Sie die Daten, um Berichte über die Benutzerleistung und Problemschwierigkeiten zu erstellen.",
      "section_5_title": "5. Analytik und Statistik",
      "section_5_desc": "Plattformmetriken und -leistung verstehen",
      "section_5_p1": "Die Statistikseite bietet umfassende Einblicke in die Plattformnutzung.",
      "section_5_p2": "Benutzerstatistiken: Verfolgen Sie die Gesamtzahl der Benutzer, die Rollenverteilung und Wachstumstrends.",
      "section_5_p3": "Problemstatistiken: Sehen Sie sich die Gesamtzahl der Probleme, die Schwierigkeitsverteilung und die gelösten Raten an.",
      "section_5_p4": "Einreichungsstatistik: Überwachen Sie Einreichungen nach Urteil, Sprache und Zeiträumen.",
      "section_5_p5": "Leistungsmetriken: Verfolgen Sie die Systemleistung, Ressourcennutzung und Reaktionszeiten.",
      "section_5_p6": "Benutzereinbindung: Identifizieren Sie aktive Benutzer, die beliebtesten Probleme und angesagte Herausforderungen.",
      "section_5_p7": "Nutzen Sie diese Daten, um fundierte Entscheidungen über die Erstellung von Inhalten und Plattformverbesserungen zu treffen.",
      "section_5_p8": "Exportieren Sie Berichte für Präsentationen, Besprechungen oder offizielle Dokumentationen.",
      "section_5_p9": "Identifizieren Sie Engpässe: Probleme mit sehr niedrigen Akzeptanzraten müssen möglicherweise geklärt werden."
    },
    "teacherGuide": {
      "section_1_title": "1. Erste Schritte als Lehrer",
      "section_1_desc": "Richten Sie Ihr Lehrerkonto ein und verstehen Sie Ihre Rolle",
      "section_1_p1": "Ihre LEHRER-Rolle gewährt Ihnen besondere Berechtigungen zum Erstellen und Verwalten von Codierungsproblemen.",
      "section_1_p2": "Im Gegensatz zu normalen Benutzern können Sie benutzerdefinierte Probleme für Ihre Schüler oder die Community entwerfen.",
      "section_1_p3": "Greifen Sie über das Hauptnavigationsmenü auf das Lehrer-Dashboard zu.",
      "section_1_p4": "Ihr Dashboard zeigt alle von Ihnen erstellten Probleme und deren Leistungskennzahlen an.",
      "section_1_p5": "Sie können sehen, welche Schüler sich an Ihren Problemen versucht haben und wie hoch die Erfolgsquote ist.",
      "section_1_p6": "Nutzen Sie diese Erkenntnisse, um Problemstellungen zu verfeinern und den Schwierigkeitsgrad anzupassen.",
      "section_2_title": "2. Probleme schaffen und bewältigen",
      "section_2_desc": "So entwerfen Sie effektive Codierungsprobleme",
      "section_2_p1": "Beginnen Sie mit einer klaren Problemstellung: Schreiben Sie eine klare, prägnante Beschreibung dessen, was die Schüler lösen müssen.",
      "section_2_p2": "Geben Sie das Eingabe-/Ausgabeformat an: Machen Sie sehr deutliche Angaben zu Eingabeformat, Ausgabeformat und Einschränkungen.",
      "section_2_p3": "Legen Sie geeignete Grenzen fest: Wählen Sie realistische Zeit- und Speichergrenzen basierend auf der erwarteten Lösungskomplexität.",
      "section_2_p4": "Erstellen Sie repräsentative Testfälle: Beziehen Sie sowohl einfache als auch komplexe Testfälle ein, um Lösungen gründlich zu validieren.",
      "section_2_p5": "Beispieltestfälle: Stellen Sie 1-2 sichtbare Beispieltestfälle bereit, um den Schülern das Verständnis des Problems zu erleichtern.",
      "section_2_p6": "Versteckte Testfälle: Erstellen Sie zusätzliche versteckte Testfälle, um hartcodierte Lösungen zu verhindern.",
      "section_2_p7": "Schwierigkeitsgrad: Schätzen Sie den Schwierigkeitsgrad des Problems ehrlich ein (EINFACH, MITTEL, SCHWER).",
      "section_2_p8": "Problem-Tags: Fügen Sie Tags hinzu, um Schülern dabei zu helfen, verwandte Probleme zu finden und schrittweise Fähigkeiten aufzubauen.",
      "section_2_p9": "Überprüfen und testen: Lösen Sie das Problem vor der Veröffentlichung selbst, um sicherzustellen, dass die Lösung korrekt ist.",
      "section_3_title": "3. Analysieren der Einreichungen von Studierenden",
      "section_3_desc": "Die Leistung der Schüler verstehen und den Lernbedarf ermitteln",
      "section_3_p1": "Alle Einsendungen anzeigen: Sehen Sie sich jeden Versuch eines Schülers an, Ihre Probleme zu lösen.",
      "section_3_p2": "Erfolgsquote: Verfolgen Sie, wie viel Prozent der Versuche zu akzeptierten Lösungen führen.",
      "section_3_p3": "Häufige Fehler: Identifizieren Sie Muster in Schülerfehlern – sie könnten auf unklare Problemstellungen hinweisen.",
      "section_3_p4": "Urteilsverteilung: Verstehen Sie, warum Schüler versagen (falsche Antwort, Zeitüberschreitung, Kompilierungsfehler usw.).",
      "section_3_p5": "Verwendete Sprachen: Verfolgen Sie, welche Programmiersprachen die Schüler bevorzugen.",
      "section_3_p6": "Leistungsdaten: Sehen Sie sich Ausführungszeit und Speichernutzung an – ermitteln Sie, ob Ihre Grenzwerte angemessen sind.",
      "section_3_p7": "Schüler mit Schwierigkeiten: Identifizieren Sie Schüler, die Schwierigkeiten haben und möglicherweise zusätzliche Unterstützung benötigen.",
      "section_3_p8": "Schnelle Löser: Erkennen Sie Schüler an, die Probleme schnell und effizient lösen.",
      "section_3_p9": "Verwenden Sie diese Daten, um Ihre Problemstellungen zu verfeinern und den Schwierigkeitsgrad nach Bedarf anzupassen.",
      "section_4_title": "4. Verwenden Sie CodeFix AI in Ihrem Klassenzimmer",
      "section_4_desc": "Integrieren Sie die Plattform in Ihren Unterricht",
      "section_4_p1": "Problemsätze: Erstellen Sie kuratierte Problemsätze für jede Lektion oder jedes Thema.",
      "section_4_p2": "Progressiver Schwierigkeitsgrad: Ordnen Sie die Aufgaben so an, dass die Herausforderung schrittweise zunimmt, wenn sich die Schüler verbessern.",
      "section_4_p3": "Hausaufgaben: Weisen Sie spezifische Probleme zu und verwenden Sie die Abgabedaten, um die Fertigstellung zu verfolgen.",
      "section_4_p4": "Peer-Learning: Ermutigen Sie die Schüler, ihre Lösungen den Klassenkameraden zu erklären.",
      "section_4_p5": "Debugging-Praxis: Nutzen Sie fehlgeschlagene Einreichungen als Lehrmomente – analysieren Sie, warum Lösungen fehlgeschlagen sind."
    },
    "adminGuideDesc": "Erfahren Sie, wie Sie die CodeFix AI-Plattform verwalten und alle Systemressourcen verwalten",
    "teacherGuideDesc": "Erfahren Sie, wie Sie effektiv Probleme schaffen und das Lernen Ihrer Schüler steuern können",
    "goToAdminPanel": "Gehen Sie zum Admin-Panel",
    "goToTeacherDashboard": "Gehen Sie zum Lehrer-Dashboard",
    "needMoreHelp": "Benötigen Sie weitere Hilfe?",
    "helpDescription": "Sehen Sie sich die Hauptanleitung an oder wenden Sie sich an den Support, um technische Unterstützung zu erhalten.",
    "viewMainGuide": "📖 Hauptanleitung anzeigen",
    "backToHome": "Zurück nach Hause",
    "quickNavigation": "Schnelle Navigation",
    "keyPoints": "Kernpunkte:",
    "screenshotPlaceholder": "[Screenshot wird hier hinzugefügt]",
    "adminOverview": "Übersicht über das Admin-Panel",
    "manageUsers": "Benutzer verwalten",
    "manageProblem": "Probleme verwalten",
    "reviewSubmissions": "Überprüfung von Einreichungen",
    "teacherDashboard": "Lehrer-Dashboard (LEHRER-Rolle)",
    "analyticsStatistics": "Analytik und Statistik",
    "adminBestPractices": "Best Practices für Administratoren",
    "adminTroubleshooting": "Beheben häufiger Probleme",
    "teacherGettingStarted": "Erste Schritte als Lehrer",
    "teacherCreatingProblems": "Probleme erstellen und verwalten",
    "teacherAnalyzingSubmissions": "Analysieren von studentischen Beiträgen",
    "teacherClassroomIntegration": "Verwenden Sie CodeFix AI in Ihrem Klassenzimmer",
    "teacherAnalytics": "Den Fortschritt der Schüler verfolgen",
    "teacherCollaboration": "Zusammenarbeit mit anderen Lehrern",
    "teacherAdvancedTips": "Erweiterte Tipps für effektiven Unterricht",
    "teacherTroubleshooting": "Behebung häufiger Unterrichtsprobleme",
    "proTip": "Profi-Tipp",
    "proTip_1": "Testen Sie Ihren Code lokal, BEVOR Sie ihn einreichen, um offensichtliche Fehler frühzeitig zu erkennen.",
    "proTip_2": "Das KI-Feedback lernt durch die Analyse Ihres Codes – lesen Sie ihn sorgfältig durch und wenden Sie die Vorschläge bei Ihrem nächsten Versuch an.",
    "proTip_3": "Manchmal sind kleine Details wichtig: nachgestellte Zeilenumbrüche, Leerzeichen, genaue Groß- und Kleinschreibung. Lesen Sie das erwartete Ausgabeformat sorgfältig durch.",
    "proTip_4": "Don't jump to hard problems too fast. Bauen Sie Ihr Fundament zunächst mit einfachen Problemen auf.",
    "proTip_5": "Jede falsche Einreichung ist ein Lernprozess – behalten Sie im Auge, welche Fehler Sie machen, und versuchen Sie, sie nicht zu wiederholen.",
    "faqTitle": "Häufig gestellte Fragen",
    "faq_1_question": "F: Kann ich externe Bibliotheken oder Importe verwenden?",
    "faq_1_answer": "A: Die meisten Standardbibliotheken sind zulässig. Vermeiden Sie jedoch externe Pakete, die nicht in der Standardbibliothek enthalten sind. Halten Sie sich an integrierte Funktionen und Datenstrukturen.",
    "faq_2_question": "F: Was bedeutet „Zeitlimit überschritten“?",
    "faq_2_answer": "A: Die Ausführung Ihres Codes dauert zu lange. Sie müssen Ihren Algorithmus optimieren – entweder einen schnelleren Algorithmus verwenden oder die Effizienz Ihrer Implementierung verbessern. Überprüfen Sie die Einschränkungen, um zu verstehen, wie groß die Eingabe sein kann.",
    "faq_3_question": "F: Wie debugge ich meinen Code?",
    "faq_3_answer": "A: Testen Sie die Beispieleingaben zunächst auf Ihrem eigenen Computer. Fügen Sie print-Anweisungen hinzu, um zu sehen, welche Werte Ihre Variablen haben. Schauen Sie sich das KI-Feedback an, um Hinweise darauf zu erhalten, was falsch ist.",
    "faq_4_question": "F: Wie oft kann ich einreichen?",
    "faq_4_answer": "A: Sie können so oft einreichen, wie Sie möchten, es gibt jedoch eine Geschwindigkeitsbegrenzung (normalerweise 5 Einsendungen pro Minute und Benutzer), um Missbrauch zu verhindern.",
    "faq_5_question": "F: Was ist der Unterschied zwischen „Falsche Antwort“ und falscher Ausgabe?",
    "faq_5_answer": "A: „Falsche Antwort“ bedeutet, dass Ihre Ausgabe nicht genau übereinstimmt. Dies können falsche Werte, falsches Format, zusätzliche Leerzeichen, fehlende Zeilenumbrüche oder alles sein, was von der erwarteten Ausgabe abweicht. Überprüfen Sie das genaue erforderliche Format.",
    "faq_6_question": "F: Soll ich Lösungen auswendig lernen?",
    "faq_6_answer": "A: Nein! Es ist weitaus wertvoller, den Ansatz zu verstehen. Versuchen Sie, Probleme selbst zu lösen. Wenn Sie nicht weiterkommen, schauen Sie sich die Erklärung an und versuchen Sie, sie umzusetzen. Das Erlernen der Technik ist wichtiger als das Auswendiglernen von Antworten.",
    "title": "So verwenden Sie CodeFix AI",
    "subtitle": "Eine umfassende Anleitung für den Einstieg und die Beherrschung der Plattform",
    "section_1_title": "1. Erste Schritte",
    "section_1_desc": "Ihre ersten Schritte auf der CodeFix AI-Plattform",
    "section_1_p1": "Willkommen bei CodeFix AI! Dieser Leitfaden hilft Ihnen, sich auf der Plattform zurechtzufinden und Codierungsprobleme effektiv zu lösen.",
    "section_1_p2": "CodeFix AI ist eine Online-Richterplattform, die Ihnen hilft, das Programmieren durch kuratierte Codierungsherausforderungen zu üben.",
    "section_1_p3": "Zu jedem Problem gehören eine detaillierte Beschreibung, Beispieltestfälle und eine automatische Auswertung Ihrer Einsendungen.",
    "section_1_p4": "Sie können Lösungen in mehreren Programmiersprachen einreichen: Python, C++ und JavaScript.",
    "section_1_p5": "Die Plattform bietet sofortiges Feedback zu Ihren Einreichungen mit detaillierten Fehlermeldungen.",
    "section_2_title": "2. Probleme verstehen",
    "section_2_desc": "Erfahren Sie, wie Sie Problemstellungen lesen und verstehen",
    "section_2_p1": "Zu jedem Problem gibt es eine klare Aussage, die beschreibt, was Sie erreichen müssen.",
    "section_2_p2": "Achten Sie auf den Abschnitt „Eingabe-/Ausgabeformat“ – dieser ist für korrekte Lösungen von entscheidender Bedeutung.",
    "section_2_p3": "Lesen Sie die Einschränkungen sorgfältig durch: Sie verraten Ihnen die gültigen Bereiche für Eingaben und die erwartete Lösungseffizienz.",
    "section_2_p4": "Beispieltestfälle zeigen Beispiele für Eingaben und erwartete Ausgaben für das Problem.",
    "section_2_p5": "Versteckte Testfälle werden zur Bewertung Ihrer Lösung nach der Einreichung verwendet.",
    "section_2_p6": "Der Schwierigkeitsgrad (Einfach/Mittel/Schwer) hilft Ihnen bei der Auswahl von Problemen, die Ihrem Können entsprechen.",
    "section_3_title": "3. Schreiben Sie Ihre Lösung",
    "section_3_desc": "Best Practices zum Schreiben von korrektem und effizientem Code",
    "section_3_p1": "Beginnen Sie damit, das Problem vollständig zu verstehen, bevor Sie Code schreiben.",
    "section_3_p2": "Testen Sie Ihre Lösung zunächst mit den bereitgestellten Musterkoffern.",
    "section_3_p3": "Denken Sie an Randfälle: leere Eingaben, sehr große Zahlen, Sonderzeichen usw.",
    "section_3_p4": "Schreiben Sie sauberen, lesbaren Code mit aussagekräftigen Variablennamen.",
    "section_3_p5": "Kommentieren Sie Ihre Logik, insbesondere bei komplexen Algorithmen.",
    "section_3_p6": "Optimieren Sie sowohl auf Korrektheit als auch auf Effizienz innerhalb der Zeit- und Speichergrenzen.",
    "section_4_title": "4. Senden Ihres Codes",
    "section_4_desc": "So reichen Sie Ihre Einsendungen ein und verfolgen sie",
    "section_4_p1": "Wählen Sie Ihre Programmiersprache aus dem Dropdown-Menü aus.",
    "section_4_p2": "Fügen Sie Ihren Code ein oder laden Sie ihn in den Editor.",
    "section_4_p3": "Klicken Sie auf die Schaltfläche „Senden“, um Ihre Lösung anhand aller Testfälle zu testen.",
    "section_4_p4": "Sie können mehrere Einsendungen einreichen – es gibt keine Strafe für den Versuch.",
    "section_4_p5": "Jede Übermittlung wird mit einem Zeitstempel versehen und in Ihrem Übermittlungsverlauf gespeichert.",
    "section_4_p6": "Das Urteil zeigt, ob Ihre Lösung alle Testfälle bestanden hat oder wo sie fehlgeschlagen ist.",
    "section_5_title": "5. Feedback verstehen",
    "section_5_desc": "So interpretieren Sie die Ergebnisse und das Feedback von CodeFix AI",
    "section_5_p1": "AKZEPTIERT: Ihre Lösung hat alle Testfälle bestanden! Glückwunsch!",
    "section_5_p2": "FALSCHE_ANTWORT: Ihre Ausgabe stimmt für einen Testfall nicht mit dem erwarteten Ergebnis überein.",
    "section_5_p3": "TIME_LIMIT_EXCEEDED: Die Ausführung Ihrer Lösung hat zu lange gedauert – optimieren Sie Ihren Algorithmus.",
    "section_5_p4": "MEMORY_LIMIT_EXCEEDED: Ihre Lösung hat zu viel Speicher verwendet – Datenstrukturen reduzieren oder optimieren.",
    "section_5_p5": "COMPILATION_ERROR: In Ihrem Code liegt ein Syntaxfehler vor. Überprüfen Sie die Syntax Ihrer Sprache.",
    "section_5_p6": "RUNTIME_ERROR: Ihr Programm ist abgestürzt – prüfen Sie, ob eine Division durch Null vorliegt, ob ein Array außerhalb des zulässigen Bereichs liegt usw.",
    "section_5_p7": "Nutzen Sie dieses Feedback, um Ihre Lösung zu verbessern und versuchen Sie es erneut.",
    "section_6_title": "6. Debugging-Strategien",
    "section_6_desc": "Techniken zum Finden und Beheben von Fehlern in Ihrem Code",
    "section_6_p1": "Fügen Sie Druck-/Konsolenanweisungen hinzu, um Variablenwerte während der Ausführung zu verfolgen.",
    "section_6_p2": "Testen Sie zuerst mit den Beispielfällen – wenn diese fehlschlagen, ist Ihre Logik definitiv falsch.",
    "section_6_p3": "Erstellen Sie Ihre eigenen Testfälle, insbesondere Randfälle wie leere Eingaben oder maximale Einschränkungen.",
    "section_6_p4": "Verfolgen Sie Ihren Code manuell mit einem Testfall, um zu sehen, was er tatsächlich tut.",
    "section_6_p5": "Verwenden Sie einen Debugger, wenn Ihre IDE dies unterstützt – gehen Sie den Code Zeile für Zeile durch.",
    "section_6_p6": "Überprüfen Sie die Problemstellung noch einmal – möglicherweise haben Sie eine Anforderung falsch verstanden.",
    "section_6_p7": "Prüfen Sie auf Off-by-One-Fehler, insbesondere bei Schleifen und der Array-Indizierung.",
    "section_7_title": "7. Leistungsoptimierung",
    "section_7_desc": "Schreiben Sie effiziente Lösungen, die innerhalb der Zeit- und Speichergrenzen ausgeführt werden",
    "section_7_p1": "Wählen Sie geeignete Datenstrukturen: Verwenden Sie Hash-Maps für O(1)-Suchen, keine Listen.",
    "section_7_p2": "Verstehen Sie die Komplexität von Big O: O(n²) funktioniert für n≤1000, aber O(n log n) ist besser für große n.",
    "section_7_p3": "Vermeiden Sie nach Möglichkeit verschachtelte Schleifen, da diese die zeitliche Komplexität vervielfachen.",
    "section_7_p4": "Nutzen Sie die frühzeitige Beendigung: Brechen Sie aus Schleifen aus, wenn Sie das Gesuchte gefunden haben.",
    "section_7_p5": "Profilieren Sie Ihren Code: Messen Sie, wo tatsächlich Zeit aufgewendet wird, bevor Sie optimieren.",
    "section_7_p6": "Lesen Sie die Einschränkungen, um zu verstehen, welcher Optimierungsgrad erforderlich ist.",
    "section_7_p7": "Manchmal ist ein einfacherer, klarerer Algorithmus schnell genug – überarbeiten Sie ihn nicht.",
    "section_8_title": "8. Häufige Fehler",
    "section_8_desc": "Fallstricke, die es bei der Lösung von Problemen zu vermeiden gilt",
    "section_8_p1": "Ganzzahlüberlauf ignorieren: Bei großen Berechnungen können Datentypgrenzen überschritten werden.",
    "section_8_p2": "Falsche Verwendung der 1-basierten oder 0-basierten Indizierung – wissen Sie, welche Arrays bei 0 beginnen.",
    "section_8_p3": "Negative Zahlen oder Nullen werden nicht als Sonderfälle behandelt.",
    "section_8_p4": "Vergessen Sie Zeilenumbrüche in der Ausgabe oder haben Sie zusätzliche Leerzeichen.",
    "section_8_p5": "Vorausgesetzt, die Einschränkungen sind kleiner als angegeben – testen Sie immer mit Maximalwerten.",
    "section_8_p6": "Logische Fehler wie die Verwendung von UND, wenn Sie ODER meinen, oder umgekehrt.",
    "section_8_p7": "Bei mathematischen Problemen werden Probleme mit der Gleitkommagenauigkeit nicht berücksichtigt.",
    "section_8_p8": "Einreichen ohne vorherige Prüfung mit Musterfällen.",
    "section_9_title": "9. Best Practices",
    "section_9_desc": "Professionelle Programmiergewohnheiten, die zum Erfolg führen",
    "section_9_p1": "Beginnen Sie immer mit einem Plan: Pseudocode oder Algorithmus vor dem eigentlichen Code.",
    "section_9_p2": "Verwenden Sie die Versionskontrolle: Behalten Sie den Überblick über Ihre Lösungen zum späteren Nachschlagen.",
    "section_9_p3": "Kommentieren Sie Ihren Code: Zukunft werden Sie sich bei Ihnen bedanken.",
    "section_9_p4": "Gründlich testen: Beispielfälle, Randfälle und Stresstests.",
    "section_9_p5": "Refactoring nach der Lösung: Machen Sie Ihren Code sauberer und effizienter.",
    "section_9_p6": "Lernen Sie von anderen: Lesen Sie akzeptierte Lösungen, um verschiedene Ansätze zu sehen.",
    "section_9_p7": "Üben Sie regelmäßig: Konsequentes Üben verbessert die Problemlösungsfähigkeiten.",
    "section_9_p8": "Merken Sie sich Lösungen nicht nur – verstehen Sie die zugrunde liegenden Konzepte.",
    "section_10_title": "10. Sprachspezifische Tipps",
    "section_10_desc": "Wichtige Überlegungen zu Python, C++ und JavaScript",
    "section_10_p1": "Python: Verwenden Sie aus Effizienzgründen integrierte Funktionen und Bibliotheken (Sammlungen, Itertools).",
    "section_10_p2": "C++: Denken Sie daran, alle erforderlichen Header einzuschließen und auf einen Ganzzahlüberlauf zu achten.",
    "section_10_p3": "JavaScript: Denken Sie daran, dass Zahlen in JS Genauigkeitsprobleme haben können – verwenden Sie BigInt für große ganze Zahlen.",
    "section_10_p4": "Alle Sprachen: Achten Sie darauf, wie Zeichenfolgen behandelt und verglichen werden.",
    "section_10_p5": "Kennen Sie die Standardbibliothek Ihrer Sprache – erfinden Sie das Rad nicht neu.",
    "section_10_p6": "Lernen Sie die typische Vorlage für Wettbewerbsprogrammierung in Ihrer Sprache."
  },
  "auth": {
    "login": "Login",
    "loginHint": "Willkommen zurück! Melden Sie sich an, um fortzufahren.",
    "register": "Registrieren",
    "registerHint": "Erstellen Sie ein neues Konto, um loszulegen.",
    "username": "Benutzername",
    "password": "Passwort",
    "haveAccount": "Sie haben bereits ein Konto?",
    "noAccount": "Sie haben noch kein Konto?",
    "invalid": "Ungültiger Benutzername oder Passwort",
    "registerFailed": "Die Registrierung ist fehlgeschlagen. Der Benutzername ist möglicherweise bereits vergeben.",
    "loading": "Laden...",
    "logout": "Abmelden",
    "profile": "Profil"
  },
  "profile": {
    "statistics": "Ihre Statistiken",
    "totalSubmissions": "Gesamtzahl der Einsendungen",
    "accepted": "Akzeptiert",
    "failed": "Fehlgeschlagen",
    "pending": "Ausstehend",
    "acceptanceRate": "Akzeptanzrate",
    "role": "Rolle",
    "userId": "Benutzer-ID",
    "account": "Konto",
    "quickLinks": "Quicklinks",
    "viewProblems": "Probleme anzeigen",
    "mySubmissions": "Meine Einsendungen",
    "globalStats": "Globale Statistiken",
    "guide": "Führung"
  },
  "stats": {
    "labels": {
      "accepted": "Wechselstrom",
      "ofTotal": "insgesamt",
      "unit": {
        "ms": "MS",
        "mb": "MB"
      }
    },
    "title": "Plattformstatistiken",
    "subtitle": "Globaler Überblick über Einreichungen, Sprachen und Leistungsmetriken",
    "totalSubmissions": "Gesamtzahl der Einsendungen",
    "submissions": "Einsendungen",
    "accepted": "Akzeptiert",
    "acceptanceRate": "Akzeptanzrate",
    "averageTime": "Durchschnittliche Zeit",
    "averageMemory": "Durchschnittlicher Speicher",
    "peakMemory": "Spitzenspeicher",
    "languageDistribution": "Sprachverteilung",
    "verdictDistribution": "Urteilsverteilung",
    "topContributors": "Top-Mitwirkende",
    "rank": "Rang",
    "user": "Benutzer",
    "rate": "Erfolgsquote"
  },
  "home": {
    "welcomeTitle": "Willkommen bei CodeFix AI",
    "welcomeDescription": "Meistern Sie Ihre Programmierfähigkeiten mit KI-gestütztem Feedback. Üben Sie Probleme, erhalten Sie sofortige Analysen und verbessern Sie Ihre Programmierfähigkeiten.",
    "startPracticing": "Beginnen Sie mit dem Üben",
    "viewGuide": "Anleitung anzeigen",
    "signIn": "Anmelden",
    "signUp": "Melden Sie sich an",
    "notLoggedIn": "Bereit, mit dem Codieren zu beginnen?",
    "notLoggedInDesc": "Melden Sie sich an oder erstellen Sie ein Konto, um mit CodeFix AI zu beginnen.",
    "solveProblems": "Probleme lösen",
    "solveProblemsDesc": "Üben Sie mit kuratierten Codierungsproblemen verschiedener Schwierigkeitsgrade.",
    "aiFeedback": "KI-Feedback",
    "aiFeedbackDesc": "Erhalten Sie eine intelligente Analyse Ihres Codes und konkrete Verbesserungstipps.",
    "trackProgress": "Verfolgen Sie den Fortschritt",
    "trackProgressDesc": "Überwachen Sie Ihre Einreichungen und Verbesserungen im Laufe der Zeit.",
    "gettingStarted": "Erste Schritte",
    "gettingStartedDesc": "Befolgen Sie unseren Einsteigerleitfaden, um zu erfahren, wie Sie CodeFix AI effektiv nutzen.",
    "howItWorks": "Wie es funktioniert",
    "chooseProblem": "Wählen Sie ein Problem",
    "chooseProblemDesc": "Durchsuchen Sie unsere Problembibliothek und wählen Sie eines aus, das Ihrem Kenntnisstand entspricht.",
    "writeSolveSubmit": "Schreiben und einreichen",
    "writeSolveSubmitDesc": "Schreiben Sie Ihre Lösung und reichen Sie sie zum Testen anhand von Testfällen ein.",
    "getAiFeedback": "Erhalten Sie KI-Feedback",
    "getAiFeedbackDesc": "Erhalten Sie sofortiges, personalisiertes Feedback, das Ihnen hilft, sich zu verbessern.",
    "readyToStart": "Bereit zum Start?",
    "readyToStartDesc": "Egal, ob Sie ein absoluter Anfänger sind oder Ihre Fähigkeiten verbessern möchten, CodeFix AI ist hier, um Ihnen zum Erfolg zu verhelfen.",
    "browseProblems": "Durchsuchen Sie Probleme",
    "viewTutorial": "📚 Tutorial ansehen",
    "teacher": "Lehrer",
    "admin": "Admin"
  },
  "admin": {
    "problems": {
      "title": "Problemmanagement",
      "createButton": "+ Problem erstellen",
      "columns": {
        "id": "AUSWEIS",
        "title": "Titel",
        "difficulty": "Schwierigkeit",
        "limits": "Grenzen",
        "data": "Daten",
        "testcases": "Testfälle",
        "statistics": "Statistiken"
      },
      "editData": "Daten bearbeiten",
      "editTestcases": "Testfälle bearbeiten"
    },
    "problemEditor": {
      "editing": "Bearbeitung",
      "formLabels": {
        "title": "Titel",
        "description": "Beschreibung",
        "difficulty": "Schwierigkeit"
      },
      "difficultyOptions": {
        "easy": "Einfach",
        "medium": "Medium",
        "hard": "Hart"
      },
      "metadata": {
        "testcaseSet": "Testfallsatz",
        "created": "Erstellt",
        "updated": "Aktualisiert"
      },
      "goToTestcases": "Gehen Sie zu Testfällen"
    },
    "statementEditor": {
      "markdown": "Abschlag",
      "preview": "Vorschau",
      "placeholder": "Schreiben Sie die Problemstellung in Markdown. Verwenden Sie $x^2$ für Mathematik."
    },
    "testcaseEditor": {
      "visibilityOptions": {
        "private": "Privat",
        "sample": "Probe"
      },
      "labels": {
        "input": "Eingang",
        "output": "Erwartete Ausgabe"
      },
      "addTestcase": "Testfall hinzufügen",
      "removeTestcase": "Entfernen"
    },
    "createProblem": {
      "heading": "Problem erstellen",
      "formLabels": {
        "title": "Titel",
        "problemId": "Problem-ID",
        "difficulty": "Schwierigkeit"
      },
      "difficultyOptions": {
        "easy": "Einfach",
        "medium": "Medium",
        "hard": "Hart"
      },
      "submitButton": "Erstellen"
    },
    "submissions": {
      "confirmDelete": "Sind Sie sicher, dass Sie diese Übermittlung löschen möchten?"
    },
    "users": "Benutzerverwaltung"
  },
  "filter": {
    "languages": {
      "python": "Python",
      "java": "Java",
      "javascript": "JavaScript",
      "cpp": "C++"
    },
    "verdicts": {
      "runtimeError": "RE (Laufzeitfehler)",
      "compilationError": "CE (Kompilierungsfehler)"
    }
  },
  "createProblem": {
    "heading": "Problem erstellen",
    "title": "Problem erstellen",
    "formLabels": {
      "title": "Titel",
      "problemId": "Problem-ID",
      "difficulty": "Schwierigkeit"
    },
    "difficultyOptions": {
      "easy": "Einfach",
      "medium": "Medium",
      "hard": "Hart"
    },
    "submitButton": "Erstellen"
  },
  "submissionFilter": {
    "languages": {
      "python": "Python",
      "cpp": "C++",
      "java": "Java",
      "javascript": "JavaScript"
    },
    "verdicts": {
      "ac": "AC (Akzeptiert)",
      "wa": "WA (falsche Antwort)",
      "re": "RE (Laufzeitfehler)",
      "tle": "TLE (Zeitlimit)",
      "mle": "MLE (Speicherlimit)",
      "ce": "CE (Kompilierungsfehler)"
    }
  },
  "statsPage": {
    "accepted": "Wechselstrom",
    "ofTotal": "insgesamt",
    "ms": "MS",
    "mb": "MB"
  },
  "teacher": {
    "nav": {
      "myProblems": "Meine Probleme",
      "studentSubmissions": "Einreichungen von Studierenden",
      "analytics": "Analytik"
    },
    "myProblems": {
      "title": "Meine Probleme",
      "noProblems": "Sie haben noch keine Probleme verursacht.",
      "columns": {
        "title": "Titel",
        "difficulty": "Schwierigkeit",
        "submissions": "Einsendungen",
        "accepted": "Akzeptiert",
        "created": "Erstellt",
        "actions": "Aktionen"
      },
      "edit": "Bearbeiten",
      "viewSubmissions": "Einsendungen"
    },
    "studentSubmissions": {
      "title": "Einreichungen von Studierenden",
      "noSubmissions": "Noch keine studentischen Beiträge.",
      "columns": {
        "id": "AUSWEIS",
        "userId": "Benutzer-ID",
        "language": "Sprache",
        "verdict": "Urteil",
        "submitted": "Eingereicht",
        "actions": "Aktionen"
      },
      "view": "Sicht"
    },
    "analytics": {
      "title": "Analytik",
      "summary": "Zusammenfassung",
      "totalProblems": "Totale Probleme",
      "totalSubmissions": "Gesamtzahl der Einsendungen",
      "accepted": "Akzeptiert",
      "rejected": "Abgelehnt",
      "pending": "Ausstehend",
      "acceptanceRate": "Akzeptanzrate",
      "summaryText": "Sie haben <strong>{{problems}}</strong> Problem(e) mit <strong>{{submissions}}</strong> Gesamtzahl der von Studierenden eingereichten Beiträge erstellt.",
      "acceptanceRateText": "Gesamtakzeptanzrate: <strong>{{rate}}%</strong>"
    }
  },
  "adminPanel": {
    "title": "Admin-Dashboard",
    "totalUsers": "Gesamtzahl der Benutzer",
    "totalSubmissions": "Gesamtzahl der Einsendungen",
    "acceptedSubmissions": "Akzeptierte Einsendungen",
    "problems": "Problemmanagement",
    "viewAll": "Alle anzeigen",
    "submissions": "Einsendungen",
    "id": "AUSWEIS",
    "username": "Benutzername",
    "role": "Rolle",
    "joined": "Beigetreten",
    "actions": "Aktionen",
    "view": "Sicht",
    "delete": "Löschen",
    "loading": "Laden",
    "previous": "← Zurück",
    "next": "Weiter →",
    "page": "Seite",
    "of": "von",
    "roleOptions": {
      "user": "Benutzer",
      "student": "Student",
      "teacher": "Lehrer",
      "admin": "Admin"
    },
    "tableHeaders": {
      "verdict": "Urteil",
      "userId": "Benutzer-ID",
      "problemId": "Problem-ID",
      "submittedAt": "Eingereicht bei"
    }
  },
  "users": {
    "searchDescription": "Suchen Sie Benutzer und sehen Sie sich ihre Profile an",
    "noResults": "Keine Benutzer gefunden, die Ihrer Suche entsprechen",
    "found": "Benutzer gefunden"
  },
  "about": {
    "title": "Über CodeFix AI",
    "tagline": "Lernen Sie programmieren durch wettbewerbsfähige Problemlösung",
    "section1Title": "Was ist CodeFix AI?",
    "section1Content": "CodeFix AI ist eine Online-Richterplattform, auf der Sie Codierungsprobleme üben, Lösungen einreichen und sofortiges Feedback erhalten können. Egal ob Sie ein Anfänger sind, der die Grundlagen erlernt, oder ein erfahrener Programmierer, der seine Fähigkeiten verbessert, CodeFix AI bietet Probleme verschiedener Schwierigkeitsstufen.",
    "section2Title": "Merkmale",
    "feature1": "Hunderte von Codierungsproblemen in mehreren Kategorien",
    "feature2": "Unterstützung für mehrere Programmiersprachen",
    "feature3": "Echtzeit-Beurteilung und detailliertes Feedback",
    "feature4": "Ranglisten und Leistungsstatistiken",
    "feature5": "Problemlösungsanalyse und Erkenntnisse",
    "feature6": "Lehrer-Dashboard zur Verwaltung von Klassenzimmern",
    "section3Title": "So beginnen Sie",
    "step1": "Erstellen Sie ein Konto, um Ihre Fortschritte zu verfolgen",
    "step2": "Durchsuchen Sie Probleme nach Schwierigkeit und Kategorie",
    "step3": "Reichen Sie Ihre Lösungen in Ihrer bevorzugten Sprache ein",
    "step4": "Erhalten Sie sofortiges Feedback und verbessern Sie Ihren Code",
    "section4Title": "Für Lehrer",
    "teacherContent": "CodeFix AI bietet Lehrern eine umfassende Plattform zum Erstellen von Problemen, Verwalten von Studenteneinreichungen und Verfolgen des Lernfortschritts mit detaillierten Analysen.",
    "contactTitle": "Kontakt und Unterstützung",
    "contactContent": "Bei Fragen oder Feedback wenden Sie sich bitte an unsere Gemeinschaft oder lesen Sie die Dokumentation."
  },
  "contests": {
    "title": "Programmier-Wettbewerbe",
    "subtitle": "Konkurrieren Sie mit anderen und verbessern Sie Ihre Codierungsfähigkeiten",
    "create": "Wettbewerb erstellen",
    "status": {
      "all": "Alle Wettbewerbe",
      "upcoming": "Bevorstehend",
      "ongoing": "Laufend",
      "finished": "Beendet"
    },
    "empty": "Keine Wettbewerbe gefunden. Kommen Sie bald zurück!",
    "notFound": "Wettbewerb nicht gefunden",
    "starts": "Beginnt",
    "ends": "Endet",
    "public": "Öffentlich",
    "private": "Privat",
    "view": "Details anzeigen",
    "details": "Details anzeigen",
    "register": "Jetzt registrieren",
    "problems": "Probleme",
    "standings": "Rangliste",
    "noProblems": "Keine Probleme in diesem Wettbewerb",
    "noStandings": "Noch keine Rangliste verfügbar",
    "participant": "Teilnehmer",
    "solved": "Gelöst",
    "penalty": "Strafzeit",
    "backToList": "Zurück zu Wettbewerben",
    "status": "Status",
    "time": "Zeit"
  }
}